:PROPERTIES:
:ID: 39bf64ec-a6c4-4359-8fae-00e135826794
:END:
#+title: History
#+description: History
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-05-21

Get version history for a country.

#+name: countries-history
#+begin_src ores-shell :exports none
countries history US
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<countries-history>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> +---------+---------+---------+---------+---------------+--------------------------+-------------------+-------------+-------------------------------+
| Alpha-2 | Alpha-3 | Numeric | Version | Name          | Official Name            | Change Reason     | Recorded By | Recorded At                   |
+---------+---------+---------+---------+---------------+--------------------------+-------------------+-------------+-------------------------------+
| US      | USA     | 840     | 1       | United States | United States of America | system.new_record | system      | 2026-01-09 16:37:38.000000000 |
+---------+---------+---------+---------+---------------+--------------------------+-------------------+-------------+-------------------------------+

ores-shell> Bye!
#+end_example
